{
  "file_path": "uploads/1763442522311.pdf",
  "filename": "MathScribe_Report.docx.pdf",
  "mime_type": "application/pdf",
  "chunks": [
    "Data Science Lab Report on MathScribe By Riya Indap 21 Sachi Jadhav 22 Durva Kadam 23 Shruti Kadam 24 Mentor: Ms. Amrita Mathur Assistant Professor St. Francis Institute of Technology (Engineering College) 2025-26 1 Index Chapter Contents Page No. No. 1 Introduction 6-7 1.1 Background 6 1.2 Scope of the project 6 1.3 Objectives and Problem Statement 6-7 2 Literature Review 8 3 Proposed Work 9 3.1 Architectural Details 9 3.1.1 Module 1 10 3.1.2 Module 2 11 3.1.3 Module 3 11-12 4 Implementation 13-17 4.1 Dataset Details 13 4.2 Algorithm Details 14 4.3 Web based Project details 15 4.4 Screenshots of GUI with Explanation 16 4.5 Performance Metrics Details 17 5 Results and Discussions 18 6 Conclusion and Future Scope 19 References 20 2 List of Abbreviations Sr. No. Abbreviation Full Form 1 AI Artificial Intelligence 2 CNN Convolutional Neural Network 3. OCR Optical Character Recognization 4. SVM Support Vector Machine 5. ReLU Rectified Linear Unit 3 List of Figures Fig. No. Figure Name Page",
    " No. 3.1 Architecture Diagram 9 4.4.1 Homepage of MathScribe 15 4.4.2 User trying to analyze a simple equation 16 4.4.3 User trying to evaluate a complex equation 16 4.5.1 Performance Matrix of MathScribe 16 4.5.2 Confusion Matrix of MathScribe 17 5.1 Training Vs Validation Accuracy 18 5.2 Training Vs Validation Loss 18 4 List of Tables Table. No. Table Name Page No. 2.1 Literature Review 8 4.1 Dataset Details 13 4.2 Algorithm Details 14 4.3 Web-based Project Details 15 5.1 Final Model Metrics 18 5 Chapter 1 Introduction 1.1 Background In recent years, the integration of Artificial Intelligence (AI) and Computer Vision has revolutionized the way machines interpret and process visual information. One of the most fascinating applications of this technology is handwritten symbol and equation recognition, which enables computers to understand and digitize mathematical notations written by humans. This has significant applications in the fields of education, document digitization, and intel",
    "ligent tutoring systems. Handwritten mathematical symbol recognition is an emerging application of computer vision and deep learning that enables machines to interpret human-written notations. Unlike printed text, handwritten symbols vary in style, size, and shape, making traditional OCR techniques less effective. This project aims to develop a CNN-based model capable of recognizing handwritten mathematical operators such as +, −, ×, ÷ and other symbols. Using image preprocessing methods like binarization and adaptive thresholding, the system enhances accuracy and robustness, paving the way for intelligent equation recognition and digitization applications. 1.2 Scope of the Project The scope of this project involves designing and implementing an intelligent deep learning-based system that can accurately recognize handwritten mathematical symbols and operators. The project aims to bridge the gap between human handwriting and digital interpretation, enabling smooth conversion of handwrit",
    "ten equations into machine-readable formats. 1. The project focuses on developing an AI-based handwritten mathematical symbol recognition system that converts handwritten inputs into digital, machine-readable form. 2. It is limited to 14 classes of mathematical symbols — digits (0–9) and basic operators (‘+’, ‘–’, ‘×’, ‘=’, ‘times’). 3. The system is designed to process only PNG image inputs for consistency in preprocessing and model compatibility. 4. Image preprocessing techniques such as grayscale conversion, binarization, and normalization are implemented to enhance feature extraction. 1.3 Objectives and Problem Statement Problem Statement: To develop a deep learning-based system capable of recognizing handwritten mathematical symbols and operators from unstructured image data and solving simple equations through an integrated user interface (UI). Traditional OCR systems struggle with variations in handwriting styles and lack user interactivity. This project bridges that gap by comb",
    "ining CNN-based recognition with a lightweight UI that interprets and evaluates handwritten equations in real-time. 6 Objectives: 1. To train a CNN-based model for recognizing handwritten digits, symbols, and operators from unstructured data. 2. To implement image preprocessing (binarization, normalization) for better feature extraction. 3. To integrate a user-friendly graphical interface that allows users to input handwritten equations. 4. To parse recognized symbols into a mathematical expression and automatically compute the result. 5. To ensure efficient processing on low-resource hardware (e.g., Iris chip) without GPU dependency. 7 Chapter 2 Literature Review Sr. Title Year Review of Paper Research Gaps No. Addressed 1 Handwritten Math Symbol 2023 • Compared CNN, SVM, • No unified Recognition Based on Multiple and hybrid models. preprocessing & Machine Learning Algorithms: A • Highlighted CNN as best training Comparative Study for symbol classification. framework. • No preprocessi",
    "ng or augmentation discussed. 2 Handwritten Mathematical 2021 • Used two attention • High Expression Recognition via decoders (L2R & R2L) for computational Attention Aggregation-based better context. demand. Bi-Directional Mutual Learning • High performance but • Not feasible for resource heavy. low-end devices. • Suitable for research-grade GPUs only. 3 Recognizing Handwritten 2020 • Proposed multiscale • Poor accuracy Mathematical Expressions as CNN converting on unstructured LaTeX Sequences Using a handwriting to LaTeX. data. Multiscale Robust Neural • Strong at structure • Needed Network – Wang & Shan parsing, not individual preprocessing symbols. pipeline for raw • Required large labeled handwritten input. data. 4 Offline Handwritten 2019 • CNN trained on offline • Lacked diverse Mathematical Symbol datasets for symbol handwriting data. Recognition Utilizing Deep classification. • Did not support Learning • Good accuracy for real-world noisy printed symbols. samples. • Limited dat",
    "aset variety. Table 2.1: Literature Review 8 Chapter 3 Proposed Work 3.1 Architectural Details This flow diagram illustrates the complete architecture of the MathScribe handwritten symbol recognition system, detailing the interaction between the frontend user interface and the backend server. Overall, the process ensures efficient client-server communication, combining deep learning inference with an interactive web-based interface for seamless handwritten equation recognition. Fig 3.1 Architecture Diagram Improvements and Enhancements ● Image Preprocessing Optimization: Implemented adaptive binarization, normalization, and noise removal techniques to enhance stroke clarity and symbol distinctiveness. 9 ● Data Augmentation and Balancing: Applied transformations such as rotation, translation, and zooming to improve dataset diversity and address class imbalance. ● Efficient Model Architecture: Deployed a lightweight CNN architecture optimized for CPU-only inference, reducing computationa",
    "l load without sacrificing accuracy. ● Adaptive Feature Handling: Integrated adaptive thresholding and normalization, enabling consistent recognition across varying handwriting styles and lighting conditions. ● Dataset Generalization: Replaced overly structured datasets with the Kaggle Handwritten Math Symbols Dataset, supplemented by additional augmented samples for real-world variability. 3.1.1 Module 1 (Data Collection in detail) The Objective is to gather and structure a diverse set of handwritten mathematical symbols essential for training the MathScribe recognition model. 1. Dataset Sources: The dataset used in this project is the Handwritten Math Symbols Dataset available on Kaggle (created by xainano). It contains grayscale images of handwritten mathematical symbols and digits collected from various individuals, representing diverse handwriting styles. 2. Symbol Coverage: The final selected 14 classes include: { '+', '-', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '=', '",
    "times' }. 3. Custom Dataset Addition: A supplementary dataset was created using user-collected handwritten samples to capture varied writing styles and enhance model generalization capability. 4. Dataset Composition: Initially, a total of 38 unique mathematical symbols were collected and analyzed during the dataset creation phase. However, after refinement and class balancing, 14 key classes were finalized for the current phase of model training and testing. 5. Metadata Organization: Each sample was mapped to its class label using structured CSV files, maintaining a one-to-one relationship between symbols and their encoded labels for efficient training reference. 6. Data Splitting Strategy: The dataset was divided into Training (80%), Validation (10%), and Testing (10%) subsets to ensure unbiased model performance evaluation and prevent overfitting. 7. Preprocessing Techniques: ● Image Binarization: Converted images to binary format to isolate strokes. ● Noise Removal: Filtered backgro",
    "und noise using morphological operations. ● Contrast Normalization: Adjusted pixel intensity to emphasize handwritten features. 8. Data Augmentation: Applied transformations such as rotation (±10°), translation, and zooming (up to 20%) to increase dataset diversity and mitigate class imbalance. 9. Outcome: The final preprocessed and augmented dataset is diverse, balanced, and standardized, providing a reliable foundation for accurate handwritten mathematical symbol recognition in the MathScribe system. 10 3.1.2 Module 2 (Feature Engineering in detail) This module focuses on transforming unstructured handwritten mathematical symbol images into structured, machine-learnable representations. The operations performed are as follows: 1. Input Standardization ○ All handwritten images are resized to a fixed resolution of 45×45 p ixels to maintain dimensional uniformity. ○ Images are converted to binary format, reducing RGB redundancy and minimizing computational overhead. 2. Binarization and ",
    "Noise Removal ○ Adaptive thresholding is applied to convert grayscale images into binary (black and white) format, enhancing symbol edge clarity. ○ Noise filtering techniques such as Gaussian blur and morphological operations are used to eliminate scanning artifacts and unwanted marks. 3. Normalization and Enhancement ○ Pixel intensities are normalized to the [0,1] range for stable gradient propagation during CNN training. ○ Contrast normalization is performed to enhance the visibility of symbol strokes and maintain consistent pixel intensity distribution. 4. Data Augmentation ○ To increase dataset variability and reduce overfitting, augmentation transformations are applied: Rotation: ±15° ○ Translation: up to 10% along X and Y axes ○ Zooming: up to 20% ○ Horizontal flipping: simulates handwriting style variations. 5. Automatic Feature Extraction (CNN-based) ○ The Convolutional Neural Network extracts multi-level spatial features, starting from low-level edges to high-level symbolic st",
    "ructures. ○ These extracted feature maps serve as discriminative representations for the classification model. 6. Outcome ○ The final feature-engineered dataset is highly consistent, noise-free, and information-rich, enabling efficient and accurate recognition of handwritten mathematical symbols and operators within the MathScribe system. 3.1.3 Module 3 (Inference and Web Deployment) This module focuses on implementing the trained model for real-time symbol recognition and integrating it into an interactive web-based user interface for end users. It bridges the gap between model development and real-world usability, allowing handwritten mathematical symbols to be recognized directly through an intuitive web interface. 1. Inference Phase 1. The trained Convolutional Neural Network (CNN) model is loaded to perform symbol prediction on unseen input images. 11 2. Input images are preprocessed in real time using the same transformations as the training pipeline including resizing to 45×45 p",
    "ixels, grayscale conversion, and normalization. 3. The processed image is passed through the CNN, which outputs a probability vector across 14 classes representing different mathematical symbols. 4. The class with the highest probability is selected as the predicted symbol, which is then displayed in the output interface. 5. The inference module is optimized for low latency and high accuracy, ensuring real-time feedback for user inputs. 2. Web Deployment Architecture 1. The model is deployed using a Flask backend, which exposes an inference API endpoint for symbol recognition. 2. The frontend interface is designed using HTML, CSS, and JavaScript allowing users to upload or draw handwritten symbols. 3. On submission, the frontend sends the input image to the backend via an HTTP POST request, where it is processed and classified by the trained CNN model. 4. The prediction result is returned to the frontend and displayed instantly, simulating a real-time Mathematical OCR experience. 5. Th",
    "e deployed system can run locally or be hosted on cloud platforms like Google Colab, Render, or Hugging Face Spaces for demonstration purposes. 3. Integration and Performance 1. The inference and web modules are fully integrated, ensuring smooth transition from data input → preprocessing → model prediction → result display. 2. Optimization techniques such as model serialization using .h5 and lightweight model loading were applied to minimize runtime overhead. 3. The deployment UI supports testing multiple symbols, clearing the canvas, and visualizing model outputs for interactive evaluation. 12 Chapter 4 Implementation 4.1 Dataset Details The dataset used in this project is the Handwritten Math Symbols Dataset available on Kaggle (created by xainano). It contains grayscale images of handwritten mathematical symbols and digits collected from various individuals, representing diverse handwriting styles. The dataset was selected for its clear class distinction, well-organized directory st",
    "ructure, and suitability for training deep learning models for handwritten symbol recognition. The dataset includes images of 14 different classes, covering digits (0–9) and basic mathematical operators. Each image represents a single handwritten symbol stored in grayscale format. PARAMETER DESCRIPTION Source Kaggle – Handwritten Math Symbols Dataset (xainano) Number of Classes 14 Symbol Set { '+', '-', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '=', 'times' } Image Format PNG Color Channel Grayscale (1 channel) Total Samples 50,000+ Train/Validation/Test Split 80% / 10% / 10% Table 4.1: Dataset Details Data Preprocessing To ensure consistency and improve model performance, several preprocessing techniques were applied: ● Image Resizing to 45×45 pixels ● Normalization of pixel values to [0, 1] ● Binarization and Noise Removal to enhance clarity ● Augmentation using rotation (±15°), horizontal shift (up to 10%), and zoom (up to 20%) to increase diversity and prevent overfitting T",
    "hese steps enhanced the model’s ability to generalize across varying handwriting styles and symbol distortions. 13 The Kaggle Handwritten Math Symbols dataset provided a clean, diverse, and well-labeled collection of handwritten digits and symbols, ideal for training the MathScribe recognition model. Through preprocessing and augmentation, the dataset was optimized for robust model learning and improved recognition accuracy. 4.2 Algorithm Details The MathScribe system employs a Convolutional Neural Network (CNN) architecture to automatically recognize handwritten mathematical symbols. CNNs are particularly effective for image-based tasks due to their ability to capture spatial hierarchies of features—ranging from simple edges to complex shapes—through convolutional and pooling operations. The algorithm was designed to balance accuracy, speed, and generalization, ensuring robust recognition across various handwriting styles. Layer Type Details Purpose Input Layer 45×45 binary image Acce",
    "pts standardized symbol images Conv2D Layer 1 32 filters, kernel size 3×3, Extracts basic edges and ReLU activation strokes MaxPooling2D Pool size 2×2 Reduces spatial dimensions Conv2D Layer 2 64 filters, kernel size 3×3, Learns more complex ReLU activation shapes and contours MaxPooling2D Pool size 2×2 Further reduces dimensions and computation Dropout 0.25 Prevents overfitting Output Layer 14 neurons, Softmax Predicts probability across activation 14 symbol classes Table 4.2:Algorithm Details 1. Activation Function: ReLU (Rectified Linear Unit) was used in hidden layers for faster convergence and non-linearity handling. 2. Output Activation: Softmax function provides class probabilities for multiclass classification. 3. Loss Function: Categorical Cross-Entropy was used to measure the difference between predicted and true class distributions. Model parameters were optimized using the Adam Optimizer, chosen for its adaptive learning rate and momentum features that accelerate convergenc",
    "e. ● Initial Learning Rate: 0.001 ● Batch Size: 32 ● Epochs: 7 (with early stopping to prevent overfitting) 14 Evaluation Metrics The model’s performance was evaluated using the following metrics: ● Accuracy (%): Measures the proportion of correctly predicted symbols. ● Precision and Recall: Evaluate class-specific prediction reliability. ● F1-Score: Balances precision and recall for imbalanced classes. ● Confusion Matrix: Provides detailed insight into misclassified symbols. The trained CNN model successfully learned distinct patterns for each handwritten symbol class, achieving high classification accuracy and strong generalization to unseen handwriting samples. This forms the core recognition engine of the MathScribe system, enabling reliable mathematical symbol interpretation for downstream expression reconstruction. 4.3 Web based Project details The MathScribe system is deployed as a web-based application to ensure accessibility, scalability, and ease of use for end-users. The web",
    " interface allows users to draw handwritten mathematical symbols, submit them for recognition, and view the interpreted results in real-time. The system integrates frontend visualization, backend inference, and model deployment services, forming a seamless end-to-end recognition pipeline. The MathScribe web system follows a three-tier architecture consisting of the Frontend (Client Layer), Backend (Server Layer), and Model Layer (Inference Engine). Layer Technology Stack Functionality Frontend (Client HTML, CSS, Provides a drawing canvas for handwritten Layer) JavaScript, React.js input and displays recognition results. Backend (Server Flask (Python) Handles API requests, processes images, and Layer) communicates with the CNN model for predictions. Model Layer Keras Performs deep learning-based symbol (Inference Engine) recognition using the trained CNN model. Table 4.3: Web-based Project Details Workflow Description The operational flow of the deployed web-based MathScribe system is a",
    "s follows: 1. User Interaction: The user draws or uploads a handwritten mathematical symbol on the web application’s interactive canvas. 15 2. Image Capture & Transmission: The drawn symbol is captured as an image (45×45 grayscale) and sent to the backend server via a RESTful API call. 3. Preprocessing & Inference: The backend applies preprocessing (binarization, normalization, resizing) and passes the image through the CNN model for prediction. 4. Prediction & Response: The model outputs the most probable symbol class, which is returned as a JSON response to the frontend. 4.4 Screenshots of GUI with Explanation Fig 4.4.1 Homepage of MathScribe Fig 4.4.2 User trying to analyze a simple equation 16 Fig 4.4.3 User trying to evaluate a complex equation 4.5 Performance Metrics Details Fig 4.5.1 Performance Matrix of MathScribe Fig 4.5.2 Confusion Matrix of MathScribe 17 Chapter 5 Results and Discussions Final Training Accuracy 99.92 % Final Validation Accuracy 99.91 % Final Training Loss 0",
    ".0043 Final Validation Loss 0.0034 Table 5.1: Final Model Metrics Fig 5.1 Training Vs Validation Accuracy Both curves show a steady increase, reaching nearly 100 % accuracy by the 7th epoch, signifying rapid and stable learning. Fig 5.2 Training Vs Validation Loss The loss curves show a consistent decrease from 0.9 to around 0.003, confirming efficient minimization of error. 18 Chapter 6 Conclusion and Future Scope a. 2. High-Accuracy Handwriting Recognition: The CNN-based MathScribe model accurately recognized handwritten digits and mathematical symbols, achieving 99.9% validation accuracy with a minimal loss of 0.003, indicating excellent learning and generalization. 3. Efficient and Stable Training: The model converged effectively within 7 epochs, showing smooth improvement in accuracy and reduction in loss without signs of overfitting or instability. 4. End-to-End Equation Solving: MathScribe not only recognized handwritten symbols but also parsed and solved mathematical equations ",
    "in real time, providing accurate computational outputs through a user-friendly interface. 5. Lightweight and Hardware-Efficient: The system was optimized to run efficiently on low-resource hardware (Iris chip) without GPU dependency, making it suitable for portable or embedded applications. 6. Robust and Scalable System: With strong recognition consistency across varied handwriting styles, MathScribe demonstrates robustness, reliability, and scalability, laying the foundation for future expansion into advanced mathematical symbols, multi-line equations, and mobile deployment. 19 References [1] Z. Xu, “Handwritten Math Symbol Recognition Based on Multiple Machine Learning Algorithms: A Comparative Study,” in Proc. 2023 Int. Conf. Image, Algorithms and Artificial Intelligence (ICIAAI) 2023, Advances in Computer Science Research, vol. 108, pp. 6492-6500, Nov. 2023. [2] X. Bian, B. Qin, X. Xin, J. Li, X. Su and Y. Wang, “Handwritten Mathematical Expression Recognition via Attention Aggrega",
    "tion-based Bi-Directional Mutual Learning,” in Proc. AAAI’22, Feb. 2022. [3] H. Wang and G. Shan, “Recognizing Handwritten Mathematical Expressions as LaTeX Sequences Using a Multiscale Robust Neural Network,” CoRR, vol. abs/2003.00817, Mar. 2020. [Online]. [4] A. Nazemi, N. Tavakolian, D. Fitzpatrick, C. Fernando and C. Y. Suen, “Offline Handwritten Mathematical Symbol Recognition Utilising Deep Learning,” arXiv preprint arXiv:1910.07395, Oct. 2019. [5] https://www.kaggle.com/datasets/xainano/handwrittenmathsymbols 20"
  ],
  "full_text_preview": "Data Science Lab Report on MathScribe By Riya Indap 21 Sachi Jadhav 22 Durva Kadam 23 Shruti Kadam 24 Mentor: Ms. Amrita Mathur Assistant Professor St. Francis Institute of Technology (Engineering College) 2025-26 1 Index Chapter Contents Page No. No. 1 Introduction 6-7 1.1 Background 6 1.2 Scope of the project 6 1.3 Objectives and Problem Statement 6-7 2 Literature Review 8 3 Proposed Work 9 3.1 Architectural Details 9 3.1.1 Module 1 10 3.1.2 Module 2 11 3.1.3 Module 3 11-12 4 Implementation 13-17 4.1 Dataset Details 13 4.2 Algorithm Details 14 4.3 Web based Project details 15 4.4 Screenshots of GUI with Explanation 16 4.5 Performance Metrics Details 17 5 Results and Discussions 18 6 Conclusion and Future Scope 19 References 20 2 List of Abbreviations Sr. No. Abbreviation Full Form 1 AI Artificial Intelligence 2 CNN Convolutional Neural Network 3. OCR Optical Character Recognization 4. SVM Support Vector Machine 5. ReLU Rectified Linear Unit 3 List of Figures Fig. No. Figure Name Page No. 3.1 Architecture Diagram 9 4.4.1 Homepage of MathScribe 15 4.4.2 User trying to analyze a simple equation 16 4.4.3 User trying to evaluate a complex equation 16 4.5.1 Performance Matrix of MathScribe 16 4.5.2 Confusion Matrix of MathScribe 17 5.1 Training Vs Validation Accuracy 18 5.2 Training Vs Validation Loss 18 4 List of Tables Table. No. Table Name Page No. 2.1 Literature Review 8 4.1 Dataset Details 13 4.2 Algorithm Details 14 4.3 Web-based Project Details 15 5.1 Final Model Metrics 18 5 Chapter 1 Introduction 1.1 Background In recent years, the integration of Artificial Intelligence (AI) and Computer Vision has revolutionized the way machines interpret and process visual information. One of the most fascinating applications of this technology is handwritten symbol and equation recognition, which enables computers to understand and digitize mathematical notations written by humans. This has significant applications in the fields of education, document digitization, and intelligent tutoring systems. Handwritten mathematical symbol recognition is an emerging application of computer vision and deep learning that enables machines to interpret human-written notations. Unlike printed text, handwritten symbols vary in style, size, and shape, making traditional OCR techniques less effective. This project aims to develop a CNN-based model capable of recognizing handwritten mathematical operators such as +, −, ×, ÷ and other symbols. Using image preprocessing methods like binarization and adaptive thresholding, the system enhances accuracy and robustness, paving the way for intelligent equation recognition and digitization applications. 1.2 Scope of the Project The scope of this project involves designing and implementing an intelligent deep learning-based system that can accurately recognize handwritten mathematical symbols and operators. The project aims to bridge the gap between human handwriting and digital interpretation, enabling smooth conversion of handwritten equations into machine-readable formats. 1. The project focuses on developing an AI-based handwritten mathematical symbol recognition system that converts handwritten inputs into digital, machine-readable form. 2. It is limited to 14 classes of mathematical symbols — digits (0–9) and basic operators (‘+’, ‘–’, ‘×’, ‘=’, ‘times’). 3. The system is designed to process only PNG image inputs for consistency in preprocessing and model compatibility. 4. Image preprocessing techniques such as grayscale conversion, binarization, and normalization are implemented to enhance feature extraction. 1.3 Objectives and Problem Statement Problem Statement: To develop a deep learning-based system capable of recognizing handwritten mathematical symbols and operators from unstructured image data and solving simple equations through an integrated user interface (UI). Traditional OCR systems struggle with variations in handwriting styles and lack user interactivity. This project bridges that gap by combining CNN-based recognition with a lightweight UI that interprets and evaluates handwritten equations in real-time. 6 Objectives: 1. To train a CNN-based model for recognizing handwritten digits, symbols, and operators from unstructured data. 2. To implement image preprocessing (binarization, normalization) for better feature extraction. 3. To integrate a user-friendly graphical interface that allows users to input handwritten equations. 4. To parse recognized symbols into a mathematical expression and automatically compute the result. 5. To ensure efficient processing on low-resource hardware (e.g., Iris chip) without GPU dependency. 7 Chapter 2 Literature Review Sr. Title Year Review of Paper Research Gaps No. Addressed 1 Handwritten Math Symbol 2023 • Compared CNN, SVM, • No unified Recognition Based on Multiple and hybrid models. preprocessing & Machine Learning Algorithms: A • Highlighted CNN as best training Comparative Study for symbol classification. framework. • No preprocessing or augmentation discussed. 2 Handwritten Mathematical 2021 • Used two attention • High Expression Recognition via decoders (L2R & R2L) for computational Attention Aggregation-based better context. demand. Bi-Directional Mutual Learning • High performance but • Not feasible for resource heavy. low-end devices. • Suitable for research-grade GPUs only. 3 Recognizing Handwritten 2020 • Proposed multiscale • Poor accuracy Mathematical Expressions as CNN converting on unstructured LaTeX Sequences Using a handwriting to LaTeX. data. Multiscale Robust Neural • Strong at structure • Needed Network – Wang & Shan parsing, not individual preprocessing symbols. pipeline for raw • Required large labeled handwritten input. data. 4 Offline Handwritten 2019 • CNN trained on offline • Lacked diverse Mathematical Symbol datasets for symbol handwriting data. Recognition Utilizing Deep classification. • Did not support Learning • Good accuracy for real-world noisy printed symbols. samples. • Limited dataset variety. Table 2.1: Literature Review 8 Chapter 3 Proposed Work 3.1 Architectural Details This flow diagram illustrates the complete architecture of the MathScribe handwritten symbol recognition system, detailing the interaction between the frontend user interface and the backend server. Overall, the process ensures efficient client-server communication, combining deep learning inference with an interactive web-based interface for seamless handwritten equation recognition. Fig 3.1 Architecture Diagram Improvements and Enhancements ● Image Preprocessing Optimization: Implemented adaptive binarization, normalization, and noise removal techniques to enhance stroke clarity and symbol distinctiveness. 9 ● Data Augmentation and Balancing: Applied transformations such as rotation, translation, and zooming to improve dataset diversity and address class imbalance. ● Efficient Model Architecture: Deployed a lightweight CNN architecture optimized for CPU-only inference, reducing computational load without sacrificing accuracy. ● Adaptive Feature Handling: Integrated adaptive thresholding and normalization, enabling consistent recognition across varying handwriting styles and lighting conditions. ● Dataset Generalization: Replaced overly structured datasets with the Kaggle Handwritten Math Symbols Dataset, supplemented by additional augmented samples for real-world variability. 3.1.1 Module 1 (Data Collection in detail) The Objective is to gather and structure a diverse set of handwritten mathematical symbols essential for training the MathScribe recognition model. 1. Dataset Sources: The dataset used in this project is the Handwritten Math Symbols Dataset available on Kaggle (created by xainano). It contains grayscale images of handwritten mathematical symbols and digits collected from various individuals, representing diverse handwriting styles. 2. Symbol Coverage: The final selected 14 classes include: { '+', '-', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '=', 'times' }. 3. Custom Dataset Addition: A supplementary dataset was created using user-collected handwritten samples to capture varied writing styles and enhance model generalization capability. 4. Dataset Composition: Initially, a total of 38 unique mathematical symbols were collected and analyzed during the dataset creation phase. However, after refinement and class balancing, 14 key classes were finalized for the current phase of model training and testing. 5. Metadata Organization: Each sample was mapped to its class label using structured CSV files, maintaining a one-to-one relationship between symbols and their encoded labels for efficient training reference. 6. Data Splitting Strategy: The dataset was divided into Training (80%), Validation (10%), and Testing (10%) subsets to ensure unbiased model performance evaluation and prevent overfitting. 7. Preprocessing Techniques: ● Image Binarization: Converted images to binary format to isolate strokes. ● Noise Removal: Filtered background noise using morphological operations. ● Contrast Normalization: Adjusted pixel intensity to emphasize handwritten features. 8. Data Augmentation: Applied transformations such as rotation (±10°), translation, and zooming (up to 20%) to increase dataset diversity and mitigate class imbalance. 9. Outcome: The final preprocessed and augmented dataset is diverse, balanced, and standardized, providing a reliable foundation for accurate handwritten mathematical symbol recognition in the MathScribe system. 10 3.1.2 Module 2 (Feature Engineering in detail) This module focuses on transforming unstructured handwritten mathematical symbol images into structured, machine-learnable representations. The operations performed are as follows: 1. Input Standardization ○ All handwritten images are resized to a fixed resolution of 45×45 p ixels to maintain dimensional uniformity. ○ Images are converted to binary format, reducing RGB redundancy and minimizing computational overhead. 2. Binarization and "
}